package seminar3.tasks.task1;

import java.io.DataInputStream;

/*
* Создать обобщенный классс тремя параметрами (T, V, K).
Класс содержит три переменные типа (T, V, K),
конструктор, принимающий на вход параметры типа (T, V, K),
методы возвращающие значения трех переменных.

Создать метод, выводящий на консоль имена классов для трех переменных класса.
Наложить ограничения на параметры типа:
Т должен реализовать интерфейс Comparable,
V должен реализовать интерфейс DataInput  и расширять класс InputStream,
K должен расширять класс Number.
 */
public class Main {

}
